In [109]:
#Dependencies
from splinter import Browser
from bs4 import BeautifulSoup as bs
import pandas as pd

In [110]:
url1 = 'https://www.timeanddate.com/weather/?sort=1&low=c'

In [111]:
 tables = pd.read_html(url1)
tables

[    Local Time and Weather in Capitals Around the World Sort By: CityCountryTimeTemperatureCities Shown: Capitals (215)Most Popular (143)Popular (356)Somewhat Popular (469)  \
 0                                      Albania, Tirana
 1                                     Algeria, Algiers
 2                                       Angola, Luanda
 3                    Antigua and Barbuda, Saint John's
 4                              Argentina, Buenos Aires
 ..                                                 ...
 182                   Vatican City State, Vatican City
 183                                 Venezuela, Caracas
 184                                     Vietnam, Hanoi
 185                                     Zambia, Lusaka
 186                                   Zimbabwe, Harare

     Local Time and Weather in Capitals Around the World Sort By: CityCountryTimeTemperatureCities Shown: Capitals (215)Most Popular (143)Popular (356)Somewhat Popular (469).1  \
 0                                         Mon 11:48 am
 1                                         Mon 11:48 am
 2                                         Mon 11:48 am
 3                                          Mon 6:48 am
 4                                          Mon 7:48 am
 ..                                                 ...
 182                                       Mon 11:48 am
 183                                        Mon 6:48 am
 184                                        Mon 5:48 pm
 185                                       Mon 12:48 pm
 186                                       Mon 12:48 pm

      Local Time and Weather in Capitals Around the World Sort By: CityCountryTimeTemperatureCities Shown: Capitals (215)Most Popular (143)Popular (356)Somewhat Popular (469).2  \
 0                                                  NaN
 1                                                  NaN
 2                                                  NaN
 3                                                  NaN
 4                                                  NaN
 ..                                                 ...
 182                                                NaN
 183                                                NaN
 184                                                NaN
 185                                                NaN
 186                                                NaN

     Local Time and Weather in Capitals Around the World Sort By: CityCountryTimeTemperatureCities Shown: Capitals (215)Most Popular (143)Popular (356)Somewhat Popular (469).3
 0                                                13 °C
 1                                                12 °C
 2                                                29 °C
 3                                                25 °C
 4                                                19 °C
 ..                                                 ...
 182                                               6 °C
 183                                              25 °C
 184                                              15 °C
 185                                                NaN
 186                                                NaN

 [187 rows x 4 columns]]

In [113]:
df = tables[0]
df.columns = ['Country', 'Date', 'Time', "Temperature"]
df

                               Country          Date  Time Temperature
0                      Albania, Tirana  Mon 11:48 am   NaN       13 °C
1                     Algeria, Algiers  Mon 11:48 am   NaN       12 °C
2                       Angola, Luanda  Mon 11:48 am   NaN       29 °C
3    Antigua and Barbuda, Saint John's   Mon 6:48 am   NaN       25 °C
4              Argentina, Buenos Aires   Mon 7:48 am   NaN       19 °C
..                                 ...           ...   ...         ...
182   Vatican City State, Vatican City  Mon 11:48 am   NaN        6 °C
183                 Venezuela, Caracas   Mon 6:48 am   NaN       25 °C
184                     Vietnam, Hanoi   Mon 5:48 pm   NaN       15 °C
185                     Zambia, Lusaka  Mon 12:48 pm   NaN         NaN
186                   Zimbabwe, Harare  Mon 12:48 pm   NaN         NaN

[187 rows x 4 columns]

In [114]:
del df["Time"]
del df["Date"]

In [115]:
df

                               Country Temperature
0                      Albania, Tirana       13 °C
1                     Algeria, Algiers       12 °C
2                       Angola, Luanda       29 °C
3    Antigua and Barbuda, Saint John's       25 °C
4              Argentina, Buenos Aires       19 °C
..                                 ...         ...
182   Vatican City State, Vatican City        6 °C
183                 Venezuela, Caracas       25 °C
184                     Vietnam, Hanoi       15 °C
185                     Zambia, Lusaka         NaN
186                   Zimbabwe, Harare         NaN

[187 rows x 2 columns]

In [116]:
df[['Country', 'B']] = df['Country'].str.split(',', 1, expand=True)
df

                 Country Temperature              B
0                Albania       13 °C         Tirana
1                Algeria       12 °C        Algiers
2                 Angola       29 °C         Luanda
3    Antigua and Barbuda       25 °C   Saint John's
4              Argentina       19 °C   Buenos Aires
..                   ...         ...            ...
182   Vatican City State        6 °C   Vatican City
183            Venezuela       25 °C        Caracas
184              Vietnam       15 °C          Hanoi
185               Zambia         NaN         Lusaka
186             Zimbabwe         NaN         Harare

[187 rows x 3 columns]

In [117]:
del df["B"]

In [118]:
df

                 Country Temperature
0                Albania       13 °C
1                Algeria       12 °C
2                 Angola       29 °C
3    Antigua and Barbuda       25 °C
4              Argentina       19 °C
..                   ...         ...
182   Vatican City State        6 °C
183            Venezuela       25 °C
184              Vietnam       15 °C
185               Zambia         NaN
186             Zimbabwe         NaN

[187 rows x 2 columns]

In [122]:
df=df.dropna()
df

                 Country Temperature
0                Albania       13 °C
1                Algeria       12 °C
2                 Angola       29 °C
3    Antigua and Barbuda       25 °C
4              Argentina       19 °C
..                   ...         ...
180           Uzbekistan       12 °C
181              Vanuatu       26 °C
182   Vatican City State        6 °C
183            Venezuela       25 °C
184              Vietnam       15 °C

[183 rows x 2 columns]

In [123]:
df[['Temperature', 'C']] = df['Temperature'].str.split(' ', 1, expand=True)

ValueError: Columns must be same length as key

In [78]:
df1=df.dropna()
df1

                 Country Temperature
0                Albania       13 °C
1                Algeria       12 °C
2                 Angola       29 °C
3    Antigua and Barbuda       25 °C
4              Argentina       19 °C
..                   ...         ...
180           Uzbekistan       12 °C
181              Vanuatu       26 °C
182   Vatican City State        6 °C
183            Venezuela       25 °C
184              Vietnam       15 °C

[183 rows x 2 columns]